#### SpecTypeId.Int Members

---

|  |
| --- |
| SpecTypeId Int Class   Properties   See Also |

This class contains constants identifying specs.

The  SpecTypeId Int  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | Integer | Integer, in discipline Common. |
| Public property Static member | NumberOfPoles | Number of Poles, in discipline Electrical. |

# See Also

SpecTypeId Int Class

Autodesk.Revit.DB Namespace